/*******************************************************************
* Copyright (c) 2013,深圳市思达仪表有限公司 
* All rights reserved. 
* 
* 文件名称：drv_extint.h 
* 文件标识：见配置管理计划书 
* 摘要：外部中断移植层

* 当前版本：1.0.0 
* 作者：ffq
* 完成日期：20131024
*******************************************************************/
#ifndef _DLT645_07_H_
#define _DLT645_07_H_

/*--------------------宏定义-------------------------------*/


/*--------------------外部常量申明-------------------------*/
extern struct uart_buff_type *uart_buff;  	                //载波通讯缓存

/*--------------------外部变量申明-------------------------*/

struct uart_buff_type			//通讯缓冲区
{
    uint8 Buffer[219];				//fe 用于发送
};

extern flag uart_err;					//通讯错误标志


    
/*--------------------外部函数申明-------------------------*/

void Uart_Order_Pro(void);
void LDRV_Test_645(void);
uint8 DLT645Main(COM_TYPEDEF com);
void DLT645_PWOER_DOWN_Init(void);






#endif
