/*******************************************************************************
* Copyright 2014      深圳思达仪表  固件部  
* All right reserved
*
* 文件名称：button
*
* 文件标识：
* 摘    要：
*
* 当前版本：
* 作    者：F06553
* 完成日期：2014-8-18
* 编译环境：D:\software\IAR_for_ARM\arm
* 
* 源代码说明：
*******************************************************************************/
#include    "all_header_file.h"

/*******************************************************************************
* 函数名称: LED setup
* 输入参数: 
* 输出参数: 
* --返回值: 
* 函数功能: -- 
*******************************************************************************/
void BUZZ_setup(void)
{ 
   IO_ConfigGPIOPin(IO_PORT3,IO_PINxA,IO_DIR_OUTPUT,IO_PULLUP_OFF);
   IO_WriteGPIOPin(IO_PORT3,IO_PINxA,IO_BIT_CLR);
}