/**********************************************************************
Key.h
**********************************************************************/
#ifndef _KEY_H_
#define _KEY_H_


#define MAX_TASKS_KEY_SCR		10
#define MAX_TASKS_KEY_SCR_LONG	        10
#define MAX_TASKS_KEY_CLR		5
#define MAX_TASKS_KEY_CLR_LONG	        5
//循显按键驱动*************************************************************
//外部常量申明-----------------------------------			
#define KEY_SCR                    (FM3_GPIO->PDIR5&= IO_PINx1)
#define KEY_Clr                    (FM3_GPIO->PDIR5&= IO_PINx2)
#define KEY_COVER                  (FM3_GPIO->PDIR6&= IO_PINx0)

#define KEY_SHORT_DELAY		        4			//4*5ms
#define KEY_LONG_DELAY		        400			//200*5ms
#define KEY_LONG_15S_DELAY		3000			//3000*5ms
#define KEY_SHORT_DELAY_LOW		1			//1*50ms
#define KEY_LONG_DELAY_LOW		20			//20*50ms
//外部变量申明-----------------------------------
extern uint16 key_scr_delay;
//宏定义-----------------------------------
//函数申明-----------------------------------


//编程按键驱动*************************************************************
//外部常量申明-----------------------------------
//外部变量申明-----------------------------------
extern uint16 key_clr_delay;
//宏定义-----------------------------------
//函数申明-----------------------------------


//开端钮盖检测驱动*************************************************************
//外部常量申明-----------------------------------
//外部变量申明-----------------------------------
extern uint16 open_term_delay;
extern uint8 KEY_SCR_LONG_PROED;
//宏定义-----------------------------------
//函数申明-----------------------------------

//开盖检测驱动*************************************************************
//外部常量申明-----------------------------------
#define OPEN_COVER_DELAY		        100			//100*5ms
//外部变量申明-----------------------------------
//宏定义-----------------------------------

//函数申明-----------------------------------
void Key_Scr_DetectPowerDown_Task(void);
void CoverDetectProcess(void);
void KeyInit(void);
void KeyPowerDownInit(void);
uint8 CoverKeyStateGet(void);
#endif 
