
/*******************************************************************
* Copyright (c) 2013,深圳市思达仪表有限公司 
* All rights reserved. 
* 
* 文件名称：TempSample.h 
* 文件标识：见配置管理计划书 
* 摘要：温度采样

* 当前版本：1.0.0 
* 作者：张玉清
* 完成日期：20131107
*******************************************************************/
#ifndef _TEMPSAMPLE_H_
#define _TEMPSAMPLE_H_

/*--------------------宏定义---------------------------*/
/*! \brief Check a value's range  */
#define IsInRange(x, min, max)    (((x>=min) && (x<=max)) ? 1 : 0) 

/*--------------------外部常量申明---------------------*/

/*--------------------外部变量申明---------------------*/

/*--------------------外部函数申明-------------------------*/
uint8 TempGet(int16 *pCurTemp, uint8 avg);

void TempTest(void);






#endif
