/*******************************************************************************
** 硬件平台: 富士通MB9AF005学习板
** 固件库  ：V1.0
** 文件名  : UserLed.c
** 实现功能: LED的IO口初始化,LED闪烁
** 作者    : 微控事业部
** 创建日期: 2013/8/11
** 版权    : 利尔达科技集团
** ----------------------------------------------------------------------------
** 修改者:
** 修改日期:
** 修改内容:
*******************************************************************************/
#include "UserLed.h"

/*******************************************************************************
** 函数名  : UserLed_Init
** 功能    : 接LED的IO口的初始化
** 输入参数: 无
** 输出参数: 无
** 作者    : 微控事业部
** 创建日期: 2013/8/11
-------------------------------------------------------------------------------
** 修改者  :
** 修改日期:
** 修改内容:
*******************************************************************************/
void UserLed_Init()
{
    #ifdef USER_IO_AN
    IO_DisableAnalogInput(USER_IO_AN);
    #endif
    IO_DisableFunc(USER_LED_PORT,USER_LED_PIN);//禁止外设功能
    IO_ConfigGPIOPin(USER_LED_PORT,USER_LED_PIN,IO_DIR_OUTPUT,IO_PULLUP_OFF);//无上拉输出
	USER_LED_OFF();//初始化熄灭LED
}

/*******************************************************************************
** 函数名  : USER_LED_ON
** 功能    : LED发亮
** 输入参数: 无
** 输出参数: 无
** 作者    : 微控事业部
** 创建日期: 2013/8/11
-------------------------------------------------------------------------------
** 修改者  :
** 修改日期:
** 修改内容:
*******************************************************************************/
void USER_LED_ON()
{
	IO_WriteGPIOPin(USER_LED_PORT,USER_LED_PIN,IO_BIT_CLR);
}

/*******************************************************************************
** 函数名  : USER_LED_OFF
** 功能    : LED熄灭
** 输入参数: 无
** 输出参数: 无
** 作者    : 微控事业部
** 创建日期: 2013/8/11
-------------------------------------------------------------------------------
** 修改者  :
** 修改日期:
** 修改内容:
*******************************************************************************/
void USER_LED_OFF()
{
	IO_WriteGPIOPin(USER_LED_PORT,USER_LED_PIN,IO_BIT_SET);
}

/*******************************************************************************
** 函数名  : UserLed_Blink
** 功能    : 接LED的IO口电平翻转,实现LED闪烁
** 输入参数: 无
** 输出参数: 无
** 作者    : 微控事业部
** 创建日期: 2013/8/11
-------------------------------------------------------------------------------
** 修改者  :
** 修改日期:
** 修改内容:
*******************************************************************************/
void UserLed_Blink()
{
	if(IO_ReadGPIOPin(USER_LED_PORT,USER_LED_PIN))//高
        USER_LED_ON();
    else
        USER_LED_OFF();
}
