/******************************************************************************
Copyright (c) 2013-2043,深圳市思达仪表有限公司 
All rights reserved. 

文件名称：Task.c 
摘    要：任务调度
作    者：张玉清
当前版本：V1.2.0-20140608

历史记录：
V1.2.0-20140608-张玉清
1 添加两级任务，替代定时器任务
2 按照编程规范整理重构代码
3 TaskAdd中的参数直接使用ms

V1.1.0-20130927-张玉清
1 解决长周期任务被超时任务打断后定时不准问题
2 添加定时器任务

V1.0.0-20090101-张玉清
1 原版
******************************************************************************/
#ifndef _TASK_H_
#define _TASK_H_

/*---------------------------------------------------------------------------*/
/*外部常数和宏定义                                                           */
/*---------------------------------------------------------------------------*/
#define SYS_TICK_LOW	(uint32)5	//低优先级系统节拍周期，单位ms//取值范围1-1000，并且是1000的商数
#define SYS_TICK_HIGH	(uint32)1	//高优先级系统节拍周期，单位ms//取值范围1-1000，并且是1000的商数
#define MAX_TASKS_LOW		45		//低优先级最大任务个数
#define MAX_TASKS_HIGH		5		//高优先级最大任务个数

/*---------------------------------------------------------------------------*/
/*外部结构体、枚举和类声明                                                   */
/*---------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*/
/*外部变量声明                                                               */
/*---------------------------------------------------------------------------*/
extern uint8 runMe;

/*---------------------------------------------------------------------------*/
/*外部函数声明                                                               */
/*---------------------------------------------------------------------------*/
void TaskInit(uint32 tickLow, uint32 tickHigh);
void TaskStart(void);
void TaskAdd(void (*Task)(void), const uint32 delay, const uint32 period, const uint8 priority);
void TaskFlash(void);
void TaskDispatch(void);
void TaskReset(void (*Task)(void), const uint32 delay, const uint32 period, const uint8 priority);

#endif
